

# 1. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. ჩამოაშორეთ ზედმეტი ინტერვალები. 
# ყველა სიმბოლო გადაიყვანეთ პატარა ასოებში და დაუმატეთ ქვესტრიქონი 'Python'. თუ შეყვანილ სტრიქონში 
# არსებობს სიტყვა "python", ჩაანაცვლეთ "Python"-ით.
# მინიშნება: ზედმეტი ინტერვალების ჩამოსაშორებელი მეთოდია .strip().
# მაგ.:
# "  Python is funny     ".strip()   ====>  "Python is funny"




# 2. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს ახალ სტრიქონს,
#  რომელიც შედგება შეყვანილი სტრიქონის პირველი ნახევრისაგან.


# inputString = "Javakhishvili"

# l = len(inputString)
# newString = ""

# for i in range(0, len(inputString)):
# 	if l < 3:
# 		break
# 	else:
# 		if i in (0, 1, 2, 3):
# 			newString = newString + inputString[i]
# 		else:
# 			continue

# print("Input string : " + inputString)
# print("New String : " + newString)



# 3. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. string მოდულის გამოყენებით 
# დაწერეთ შემოწმება. სტრიქონი ვალიდურია მაშინ, როდესაც ის შეიცავს ერთ ციფრს და არ
# არის დამატებითი სიმბოლოები ('!', '~', '#', '$' და ა.შ.)



st = input("Enter a string: ")

if st == st[::-1]:
  print(f"{st} is palindrom")
else:
  print(f"{st} is not palindrom")







# 4.დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს, სტრიქონი გადაყავს ბაიტებში, ბეჭდავს 
# მნიშვნელობას და შემდეგ კი გადაყავს ბაიტებიდან სტრიქონში და ბეჭდავს სტრიქონს.
