



# 1. დაწერეთ პითონის პროგრამა, რომელიც დასაწყისში შექმნის ცარიელ სიას ([]), თუ მომხარებელი შეიყვანს სიმბოლო 'a'-ს, ნიშნავს რომ უნდა
# დაამატოთ სიაში რიცხვი; თუ აკრიფა 'r', სიიდან უნა წაიშალოს რიცხვი; 'e'-ს შეტანისას პროგრამამ უნდა დაასრულოს მუშაობა.
# მიღებული შედეგი დაბეჭდეთ კონსოლში.
# მომხარებელმა უნდა შეიყვანოს შემდეგი სტრუქტურით ბრძანება "{command} {number}" commands:

# a – append
# r – remove
# e – exit
# მხოლოდ გამოიყენეთ ეს ბრძანებები და მოახდინეთ სიაზე ზემოქმედება.





# arr = ['start', 100, 2, 56, 3, 4, 11, 50, '200', True, [200, 10, 'text'], 'paata']

# for i in arr:
#   if type(i) == list:
#     if 'text' in i:
#       i.remove('text')

# print(arr)





# 2 . დაწერეთ პითონის პროგრამა, რომელიც შექმნის სიას my_list = [43, '22', 12, 66, 210, ["hi"], და შეასრულებს შემდეგ ნაბიჯებს:

# a. დაბეჭდავს 210-ის ინდექსს;
# b. დაამატებს ბოლო ელემენტში ტექსტს "hello";
# c. წაშლის მეორე ინდექსზე მდგომ ელემენტს და დაბეჭდავს სიას;
# d. შექმენით ახალი სია my_llist_2, რომელსაც ექნება my_llist-ის მნიშვნელობა, გაასუფთავეთ my_llist_2-ის მნიშნველობა და 
# დაბეჭდეთ ორივე სია.



my_list = [43, '22', 12, 66, 210, ["hi"]]

# num = int(input("Enter a number: "))

if num is my_list[4]:
  print(my_list[4])

# numb = eval(input("Enter a number: "))
# text = input("Enter a text: ")

# for i in my_list:
#   if numb in my_list:
#     my_list.remove(numb)
  
#   if type(i) == list and text in i:
#     i.remove(text)

# print(my_list)




# 3 დაწერეთ პითნის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და regex-ით შეამოწმებს შეყვანილი ნომერი იცავს თუ 
# არა "(123) 456-789" ფორმატს, თუ იცავს დააბრუნეთ შეყნვაილი ტელეფონის ნომერი, 
# წინააღმდეგ შემთხვევაში გამოიტანეთ "Invalid format" ტექსტი.